Revit 2027 API
RevisionNumberingSequence.HasValidNumericRevisionSettings Method
 Checks whether the revision numbering sequence owns a valid numeric revision settings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasValidNumericRevisionSettings()
Public Function HasValidNumericRevisionSettings As Boolean
public:
bool HasValidNumericRevisionSettings()
member HasValidNumericRevisionSettings : unit -> bool
Return Value
Boolean
 True if the revision numbering sequence owns a valid numeric revision settings.
See Also
Reference
RevisionNumberingSequence Class
Autodesk.Revit.DB Namespace